public class Note {
    /*
    1. 오류란 무엇인가
    - 컴파일 오류 (compile error): 프로그램 코드 작성 중 발생하는 문법적 오류
    - 실행 오류 (runtime error): 실행 중인 프로그램이 의도하지 않은 동작을 하거나(bug) 프로그램이 중지되는 오류
    - 실행 오류 시 비정상 종료는 서비스 운영에 치명적
    - 오류가 발생할 수 있는 경우 로그 (log)를 남겨 추후 이를 분석하여 원인을 찾아야 함
    - 자바는 예외 처리를 통하여 프로그램의 비정상 종료를 막고 log 를 남길 수 있음

    2. 오류와 예외 클래스
    - 시스템 오류 (error): 가상 머신에서 발생, 프로그래머가 처리할 수 없음
                         동적 메모리 없는 경우, 스택 오버 플로우 등
    - 예외 (Exception): 프로그램에서 제어할 수 있는 오류
                       읽어 들이려는 파일이 존재하지 않는경우, 네트웍 연결이 끊어진 경우

                       [Throwable]

                  [Error]        [Exception]
     */
}
